tsung/scripts/varied.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="35.160.253.247" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
   <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="8" unit="second"></users>
   </arrivalphase>
   <!--<arrivalphase phase="5" duration="30" unit="second">
     <users arrivalrate="16" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="6" duration="30" unit="second">
     <users arrivalrate="32" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="7" duration="30" unit="second">
     <users arrivalrate="64" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="8" duration="30" unit="second">
     <users arrivalrate="128" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="9" duration="30" unit="second">
     <users arrivalrate="256" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="10" duration="30" unit="second">
     <users arrivalrate="512" unit="second"></users>
   </arrivalphase>-->

  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
 
    <session name="landing-page" probability="40" type="ts_http">

      <!--****************************************************-->
      <!--****************************************************-->
      <!-- User visits the homepage -->

      <!-- start out at the homepage -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is looking at pictures and options -->
      <thinktime value="2" random="true"></thinktime>
      <!--****************************************************-->
      <!--****************************************************-->




      <!-- Debug dynamic variables  --> 
      
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
        io:format([126, $p, 126, $n, 126, $n], [DynVars]),
        ok end.">
        <var name="dump" />
      </setdynvars>

    </session>

    <session name="view-and-search" probability="30" type="ts_http">


      <!--****************************************************-->
      <!--****************************************************-->
      <!-- Define random numbers -->

      <!-- Define a dynamic tournament number -->
      <setdynvars sourcetype="random_number" start="1" end="5">
        <var name="random_tournament_number" />
      </setdynvars>

      <!-- Define a dynamic match number -->
      <setdynvars sourcetype="random_number" start="42" end="89">
        <var name="random_match_number" />
      </setdynvars>

      <!-- Define a dynamic club number -->
      <setdynvars sourcetype="random_number" start="1" end="10">
        <var name="random_club_number" />
      </setdynvars>

      <!-- Define a dynamic player number -->
      <setdynvars sourcetype="random_number" start="1" end="200">
        <var name="random_player_number" />
      </setdynvars>
      <!--****************************************************-->
      <!--****************************************************-->





      <!--****************************************************-->
      <!--****************************************************-->
      <!-- User visits tournaments matches clubs and players -->

      <!-- User vists tournament page -->
      <request subst="true">
        <http url='/tournaments/%%_random_tournament_number%%' version='1.1' method='GET'></http>
      </request>

      <!-- Wait for user to view tournament -->
      <thinktime value="2" random="true"></thinktime>

      <!-- User vists match page -->
      <request subst="true">
        <http url='/matches/%%_random_match_number%%' version='1.1' method='GET'></http>
      </request>

      <!-- Wait for user to view match -->
      <thinktime value="2" random="true"></thinktime>

      <!-- User vists club page -->
      <request subst="true">
        <http url='/clubs/%%_random_club_number%%' version='1.1' method='GET'></http>
      </request>

      <!-- Wait for user to view club-->
      <thinktime value="2" random="true"></thinktime>

      <!-- User vists player page -->
      <request subst="true">
        <http url='/players/%%_random_player_number%%' version='1.1' method='GET'></http>
      </request>

      <!-- Wait for user to view player-->
      <thinktime value="2" random="true"></thinktime>
      <!--****************************************************-->
      <!--****************************************************-->





      <!--****************************************************-->
      <!--****************************************************-->
      <!-- User searches for player -->

      <!-- User searches for player named "Julie"  -->
      <request>
        <http url='/players?utf8=%E2%9C%93&amp;search=Julie&amp;commit=Search' version='1.1' method='GET'></http>
      </request>

      <!-- Wait for user to view results-->
      <thinktime value="2" random="true"></thinktime>
      <!--****************************************************-->
      <!--****************************************************-->





      <!-- Debug dynamic variables  --> 
      
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
        io:format([126, $p, 126, $n, 126, $n], [DynVars]),
        ok end.">
        <var name="dump" />
      </setdynvars>

    </session>

    <session name="news-test" probability="30" type="ts_http">


      <!--****************************************************-->
      <!--****************************************************-->
      <!-- User visits News Section -->

      <!-- User visits news page  -->
      <request>
        <http url='/news' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is viewing news-->
      <thinktime value="2" random="true"></thinktime>

      <!-- User vists news creation page  -->
      <request>
        <http url='/news/new' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 10 seconds, user is filling out news creation form -->
      <thinktime value="10" random="true"></thinktime>
      
      <!-- User submits news creation form to create a new news article -->
      <request subst="true">
        <dyn_variable name="created_news_url" re="[Ll]ocation: (http://.*)\r"/>
        <dyn_variable name="created_news_id" re="[Ll]ocation: http://.*/news/(.*)\r"/>
        <http url='/news' version='1.1' method='POST' contents='news%5Bnewslink%5D=wef&amp;news%5Btitle%5D=awef&amp;news%5Bsubtext%5D=awef&amp;news%5Bimglink%5D=awef&amp;commit=Create+News'></http>
      </request>

      <!-- User visits edit page for newly created article -->
      <request subst="true">
        <http url='/news/%%_created_news_id%%/edit' version='1.1' method='GET'></http>
      </request>

      <!-- Wait for user to fill in edit form -->
      <thinktime value="2" random="true"></thinktime>

      <!-- User edits newly created article -->
      <request subst="true">
        <http url='/news/%%_created_news_id%%' version='1.1' method='PATCH' contents="news%5Bnewslink%5D=newlink&amp;news%5Btitle%5D=NewTitle&amp;news%5Bsubtext%5D=Why&amp;news%5Bimglink%5D=Newimagelink&amp;commit=Update+News"></http>
      </request>

      <!-- Wait for user to view news -->
      <thinktime value="2" random="true"></thinktime>

      <!-- User deletes newly created article -->
      <request subst="true">
        <http url='/news/%%_created_news_id%%' version='1.1' method='DELETE'></http>
      </request>
      <!--****************************************************-->
      <!--****************************************************-->





      <!-- Debug dynamic variables  --> 
      
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
        io:format([126, $p, 126, $n, 126, $n], [DynVars]),
        ok end.">
        <var name="dump" />
      </setdynvars>

    </session>
    
  </sessions>
</tsung>